<?php

//20.Приведите число 20 к типу boolean. Объясните результат.
//21. Приведите число 0 к типу boolean. Объясните результат.
//22. Приведите число -20 к типу boolean. Объясните результат.
//23. Напишите 3 строки, используя три разные функции для вывода текста.
//24. Создайте в файле 3 комментария тремя разными типами.

//20.Приведите число 20 к типу boolean. Объясните результат.

$a = (boolean) 20;
var_dump ($a);

//21. Приведите число 0 к типу boolean. Объясните результат.

$a = (boolean) 0;
var_dump ($a);

//22. Приведите число -20 к типу boolean. Объясните результат.

$a = (boolean) -20;
var_dump ($a);

//23. Напишите 3 строки, используя три разные функции для вывода текста.

echo 'Test';
printf('Test');
print 'Test';

//24. Создайте в файле 3 комментария тремя разными типами.

// echo 'Test';
/* echo 'again'
*/
#Test