<?php
//15. Написать калькулятор. Переменная $a = изменяемое число. Переменная $b = изменяемое число. Переменная $operator = ‘+’ или ‘-’ или ‘/’ или ‘*’ или '%' (остаток от деления). На экран выводить результат в зависимости от значений этих переменных. Не забудьте про деление на 0, если надо - выдавать ошибку что на 0 делить нельзя.

$a = $_GET['a'];
$b = $_GET['b'];
$operator = $_GET['operator'];

if ($operator == '*') {
    $result = $a * $b;
}
if ($operator = '/') {
    $result = $a / $b;
}
if ($operator = '+') {
    $result = $a + $b;
}
if ($operator = '-') {
    $result = $a - $b;
}
echo
else if ($operator = '/' && $b = 0) {
    echo 'Обратно в школу!';
}

